In [56]:
### 176. Second Highest Salary

import pandas as pd

data = [[1, 100], [2, 200], [3, 300], [4, 400], [5, 500], [6,600], [7, 400]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'Int64', 'salary':'Int64'})

data = [[10, 40]]
employee2 = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'Int64', 'salary':'Int64'})

In [108]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    emploee = employee.sort_values(by='salary')
    if emploee['salary'].count() < 2:
        return pd.DataFrame({'SecondHighestSalary': [pd.NA]})
    #emploee = employee.sort_values(by='salary')
    else:
        return pd.DataFrame({'SecondHighestSalary': [employee.iloc[-2].loc['salary']]})

In [110]:
second_highest_salary(employee)

   SecondHighestSalary
0                  600